(function () { //функцию вот так делаем, что бы точно знать что локульные переменные не попадают в глобальную область
'use strict';   ///эта строчка защищает от ошибок(пока прост запомнить)

//x = "hell world"

angular.module('myFirstApp', [])  //делаем модуль Ангулар и назовем его 'myFirstApp';  второй параметр([]) - это 
                                  //список зависимостей в виде массива 

.controller('MyFirstController', function ($scope) {  //здесь описание контролера, т.е. скорее всего представления - 
                                                //index.html, 2 парамент - это ф-ция этого контроллера
                                                //Контроллер — это место, где живут данные представления и логика представления представления, 
                                                //так что да, это и есть ViewModel
     //$scope - это специальный объект Angular (об этом говорит знак $, это зарезервированный знак Angular). Этот объект будет связывать наше модель представления 
     //с нашим представлением 
     $scope.name = "Belyura";  //теперь name сидит в области, а эта область доступна моему ng-controller
     $scope.sayHello = function () {
         return "Hello Cursera!";
     };                                       

});

})();
