(function () { //функцию вот так делаем, что бы точно знать что локульные переменные не попадают в глобальную область
'use strict';   ///эта строчка защищает от ошибок(пока прост запомнить)

//x = "hell world"

angular.module('myFirstApp', [])  //делаем модуль Ангулар и назовем его 'myFirstApp';  второй параметр([]) - это 
                                  //список зависимостей в виде массива 

.controller('MyFirstController', function () {  //здесь описание контролера, т.е. скорее всего представления - 
                                                //index.html, 2 парамент - это ф-ция этого контроллера

});

})();
